import random

""" Задача 2: Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) | """

# Решение:

# number1 = int(input("Введите первое число: "))
# number2 = int(input("Введите второе число: "))
# number3 = int(input("Введите третье число: "))

# print(number1, "+", number2, "+", number3)
# print(number1 + number2 + number3)

""" Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

*Пример:*

6 -> 1  4  1
24 -> 4  16  4
    60 -> 10  40  10 """

# cranes = int(input("Общее кол-во журавликов: "))
# Я не знаю, как это сделать =(


""" Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

*Пример:*

385916 -> yes
123456 -> no """

# Решение:

# a = random.randint(0, 9)
# b = random.randint(0, 9)
# c = random.randint(0, 9)
# d = random.randint(0, 9)
# e = random.randint(0, 9)
# f = random.randint(0, 9)

# print(a, b, c, d, e, f)

# sum1 = a + b + c
# sum2 = d + e + f

# if (sum1 == sum2): 
#   print('YES')
# else:
#   print('NO')

""" Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

*Пример:*

3 2 4 -> yes
3 2 1 -> no """

# Я не знаю, как это сделать =(
